{"format": "layers-model", "generatedBy": "keras v2.13.1", "convertedBy": "TensorFlow.js Converter v4.9.0", "modelTopology": {"keras_version": "2.13.1", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adadelta", "config": {"name": "Adadelta", "learning_rate": 0.0010000000474974513, "decay": 0.0, "rho": 0.949999988079071, "epsilon": 1e-07}}}}, "weightsManifest": [{"paths": ["group1-shard1of95.bin", "group1-shard2of95.bin", "group1-shard3of95.bin", "group1-shard4of95.bin", "group1-shard5of95.bin", "group1-shard6of95.bin", "group1-shard7of95.bin", "group1-shard8of95.bin", "group1-shard9of95.bin", "group1-shard10of95.bin", "group1-shard11of95.bin", "group1-shard12of95.bin", "group1-shard13of95.bin", "group1-shard14of95.bin", "group1-shard15of95.bin", "group1-shard16of95.bin", "group1-shard17of95.bin", "group1-shard18of95.bin", "group1-shard19of95.bin", "group1-shard20of95.bin", "group1-shard21of95.bin", "group1-shard22of95.bin", "group1-shard23of95.bin", "group1-shard24of95.bin", "group1-shard25of95.bin", "group1-shard26of95.bin", "group1-shard27of95.bin", "group1-shard28of95.bin", "group1-shard29of95.bin", "group1-shard30of95.bin", "group1-shard31of95.bin", "group1-shard32of95.bin", "group1-shard33of95.bin", "group1-shard34of95.bin", "group1-shard35of95.bin", "group1-shard36of95.bin", "group1-shard37of95.bin", "group1-shard38of95.bin", "group1-shard39of95.bin", "group1-shard40of95.bin", "group1-shard41of95.bin", "group1-shard42of95.bin", "group1-shard43of95.bin", "group1-shard44of95.bin", "group1-shard45of95.bin", "group1-shard46of95.bin", "group1-shard47of95.bin", "group1-shard48of95.bin", "group1-shard49of95.bin", "group1-shard50of95.bin", "group1-shard51of95.bin", "group1-shard52of95.bin", "group1-shard53of95.bin", "group1-shard54of95.bin", "group1-shard55of95.bin", "group1-shard56of95.bin", "group1-shard57of95.bin", "group1-shard58of95.bin", "group1-shard59of95.bin", "group1-shard60of95.bin", "group1-shard61of95.bin", "group1-shard62of95.bin", "group1-shard63of95.bin", "group1-shard64of95.bin", "group1-shard65of95.bin", "group1-shard66of95.bin", "group1-shard67of95.bin", "group1-shard68of95.bin", "group1-shard69of95.bin", "group1-shard70of95.bin", "group1-shard71of95.bin", "group1-shard72of95.bin", "group1-shard73of95.bin", "group1-shard74of95.bin", "group1-shard75of95.bin", "group1-shard76of95.bin", "group1-shard77of95.bin", "group1-shard78of95.bin", "group1-shard79of95.bin", "group1-shard80of95.bin", "group1-shard81of95.bin", "group1-shard82of95.bin", "group1-shard83of95.bin", "group1-shard84of95.bin", "group1-shard85of95.bin", "group1-shard86of95.bin", "group1-shard87of95.bin", "group1-shard88of95.bin", "group1-shard89of95.bin", "group1-shard90of95.bin", "group1-shard91of95.bin", "group1-shard92of95.bin", "group1-shard93of95.bin", "group1-shard94of95.bin", "group1-shard95of95.bin"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "dense/kernel", "shape": [774400, 128], "dtype": "float32"}, {"name": "dense/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [128, 10], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [10], "dtype": "float32"}]}]}